# Задание 5.15
# Напишите программу, выводящую на печать количество слов в строке.
# Слова разделяются одним или несколькими пробелами.

string = 'Антон учится программированию'
print(len(string.split(' ')))