# Напишите команду, которая выводит в консоль число 5.724609312 с
# точностью до трёх знаков после точки. Что получилось?

print(f'{5.724609312:.3f}')
print('{:.3f}'.format(5.724609312))