# Задание 4.12
# Если у вас Python 3.10 или более поздней версии,
# посмотрите, что получится, если попробовать вывести в консоль результат такого выражения:
# -30 ** 99999. А теперь попробуйте вывести его в другой системе счисления
# (например, двоичной или шестнадцатеричной).

print(hex(-30 ** 99999)) #шестнадцатеричная
print(oct(-30 ** 99999)) #восьмерчиная
print(bin(-30 ** 99999)) #двоичная
print(-30 ** 99999)